# Константы для сообщений об ошибках
ERROR_BOTH_HABIT_AND_REWARD = "Нельзя одновременно выбирать связанную привычку и указывать вознаграждение."
ERROR_LONG_EXECUTION_TIME = "Время выполнения должно быть не больше 180 секунд."
ERROR_UNPLEASANT_RELATED_HABIT = "В связанные привычки могут попадать только привычки с признаком приятной привычки."
ERROR_PLEASANT_WITH_BONUS = "У приятной привычки не может быть вознаграждения или связанной привычки."
ERROR_COMPLETION_DURATION = "Нельзя выполнять привычку реже, чем 1 раз в 7 дней."

